MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx450f128l.h
extern volatile __RPC14Rbits_t RPC14Rbits __asm__ ("RPC14R") __attribute__((section("sfrs"), address(0xBF80FBB8)));
#define RPD0R RPD0R
extern volatile uint32_t   RPD0R __attribute__((section("sfrs"), address(0xBF80FBC0)));
typedef struct {
  uint32_t RPD0R:4;
} __RPD0Rbits_t;
extern volatile __RPD0Rbits_t RPD0Rbits __asm__ ("RPD0R") __attribute__((section("sfrs"), address(0xBF80FBC0)));
#define RPD1R RPD1R
extern volatile uint32_t   RPD1R __attribute__((section("sfrs"), address(0xBF80FBC4)));
typedef struct {
  uint32_t RPD1R:4;
} __RPD1Rbits_t;
extern volatile __RPD1Rbits_t RPD1Rbits __asm__ ("RPD1R") __attribute__((section("sfrs"), address(0xBF80FBC4)));
#define RPD2R RPD2R
extern volatile uint32_t   RPD2R __attribute__((section("sfrs"), address(0xBF80FBC8)));
typedef struct {
  uint32_t RPD2R:4;
} __RPD2Rbits_t;
extern volatile __RPD2Rbits_t RPD2Rbits __asm__ ("RPD2R") __attribute__((section("sfrs"), address(0xBF80FBC8)));
#define RPD3R RPD3R
extern volatile uint32_t   RPD3R __attribute__((section("sfrs"), address(0xBF80FBCC)));
typedef struct {
  uint32_t RPD3R:4;
} __RPD3Rbits_t;
extern volatile __RPD3Rbits_t RPD3Rbits __asm__ ("RPD3R") __attribute__((section("sfrs"), address(0xBF80FBCC)));
#define RPD4R RPD4R
extern volatile uint32_t   RPD4R __attribute__((section("sfrs"), address(0xBF80FBD0)));
typedef struct {
  uint32_t RPD4R:4;
} __RPD4Rbits_t;
extern volatile __RPD4Rbits_t RPD4Rbits __asm__ ("RPD4R") __attribute__((section("sfrs"), address(0xBF80FBD0)));
#define RPD5R RPD5R
extern volatile uint32_t   RPD5R __attribute__((section("sfrs"), address(0xBF80FBD4)));
typedef struct {
  uint32_t RPD5R:4;
} __RPD5Rbits_t;
extern volatile __RPD5Rbits_t RPD5Rbits __asm__ ("RPD5R") __attribute__((section("sfrs"), address(0xBF80FBD4)));
#define RPD8R RPD8R
extern volatile uint32_t   RPD8R __attribute__((section("sfrs"), address(0xBF80FBE0)));
typedef struct {
  uint32_t RPD8R:4;
} __RPD8Rbits_t;
extern volatile __RPD8Rbits_t RPD8Rbits __asm__ ("RPD8R") __attribute__((section("sfrs"), address(0xBF80FBE0)));
#define RPD9R RPD9R
extern volatile uint32_t   RPD9R __attribute__((section("sfrs"), address(0xBF80FBE4)));
typedef struct {
  uint32_t RPD9R:4;
} __RPD9Rbits_t;
extern volatile __RPD9Rbits_t RPD9Rbits __asm__ ("RPD9R") __attribute__((section("sfrs"), address(0xBF80FBE4)));
#define RPD10R RPD10R
extern volatile uint32_t   RPD10R __attribute__((section("sfrs"), address(0xBF80FBE8)));
typedef struct {
  uint32_t RPD10R:4;
} __RPD10Rbits_t;
extern volatile __RPD10Rbits_t RPD10Rbits __asm__ ("RPD10R") __attribute__((section("sfrs"), address(0xBF80FBE8)));
#define RPD11R RPD11R
extern volatile uint32_t   RPD11R __attribute__((section("sfrs"), address(0xBF80FBEC)));
typedef struct {
  uint32_t RPD11R:4;
} __RPD11Rbits_t;
extern volatile __RPD11Rbits_t RPD11Rbits __asm__ ("RPD11R") __attribute__((section("sfrs"), address(0xBF80FBEC)));
#define RPD12R RPD12R
extern volatile uint32_t   RPD12R __attribute__((section("sfrs"), address(0xBF80FBF0)));
typedef struct {
  uint32_t RPD12R:4;
} __RPD12Rbits_t;
extern volatile __RPD12Rbits_t RPD12Rbits __asm__ ("RPD12R") __attribute__((section("sfrs"), address(0xBF80FBF0)));
#define RPD14R RPD14R
extern volatile uint32_t   RPD14R __attribute__((section("sfrs"), address(0xBF80FBF8)));
typedef struct {
  uint32_t RPD14R:4;
} __RPD14Rbits_t;
extern volatile __RPD14Rbits_t RPD14Rbits __asm__ ("RPD14R") __attribute__((section("sfrs"), address(0xBF80FBF8)));
#define RPD15R RPD15R
extern volatile uint32_t   RPD15R __attribute__((section("sfrs"), address(0xBF80FBFC)));
typedef struct {
  uint32_t RPD15R:4;
} __RPD15Rbits_t;
extern volatile __RPD15Rbits_t RPD15Rbits __asm__ ("RPD15R") __attribute__((section("sfrs"), address(0xBF80FBFC)));
#define RPE3R RPE3R
extern volatile uint32_t   RPE3R __attribute__((section("sfrs"), address(0xBF80FC0C)));
typedef struct {
  uint32_t RPE3R:4;
} __RPE3Rbits_t;
extern volatile __RPE3Rbits_t RPE3Rbits __asm__ ("RPE3R") __attribute__((section("sfrs"), address(0xBF80FC0C)));
#define RPE5R RPE5R
extern volatile uint32_t   RPE5R __attribute__((section("sfrs"), address(0xBF80FC14)));
typedef struct {
  uint32_t RPE5R:4;
} __RPE5Rbits_t;
extern volatile __RPE5Rbits_t RPE5Rbits __asm__ ("RPE5R") __attribute__((section("sfrs"), address(0xBF80FC14)));
#define RPE8R RPE8R
extern volatile uint32_t   RPE8R __attribute__((section("sfrs"), address(0xBF80FC20)));
typedef struct {
  uint32_t RPE8R:4;
} __RPE8Rbits_t;
extern volatile __RPE8Rbits_t RPE8Rbits __asm__ ("RPE8R") __attribute__((section("sfrs"), address(0xBF80FC20)));
#define RPE9R RPE9R
extern volatile uint32_t   RPE9R __attribute__((section("sfrs"), address(0xBF80FC24)));
typedef struct {
  uint32_t RPE9R:4;
} __RPE9Rbits_t;
extern volatile __RPE9Rbits_t RPE9Rbits __asm__ ("RPE9R") __attribute__((section("sfrs"), address(0xBF80FC24)));
#define RPF0R RPF0R
extern volatile uint32_t   RPF0R __attribute__((section("sfrs"), address(0xBF80FC40)));
typedef struct {
  uint32_t RPF0R:4;
} __RPF0Rbits_t;
extern volatile __RPF0Rbits_t RPF0Rbits __asm__ ("RPF0R") __attribute__((section("sfrs"), address(0xBF80FC40)));
#define RPF1R RPF1R
extern volatile uint32_t   RPF1R __attribute__((section("sfrs"), address(0xBF80FC44)));
typedef struct {
  uint32_t RPF1R:4;
} __RPF1Rbits_t;
extern volatile __RPF1Rbits_t RPF1Rbits __asm__ ("RPF1R") __attribute__((section("sfrs"), address(0xBF80FC44)));
#define RPF2R RPF2R
extern volatile uint32_t   RPF2R __attribute__((section("sfrs"), address(0xBF80FC48)));
typedef struct {
  uint32_t RPF2R:4;
} __RPF2Rbits_t;
extern volatile __RPF2Rbits_t RPF2Rbits __asm__ ("RPF2R") __attribute__((section("sfrs"), address(0xBF80FC48)));
#define RPF4R RPF4R
extern volatile uint32_t   RPF4R __attribute__((section("sfrs"), address(0xBF80FC50)));
typedef struct {
  uint32_t RPF4R:4;
} __RPF4Rbits_t;
extern volatile __RPF4Rbits_t RPF4Rbits __asm__ ("RPF4R") __attribute__((section("sfrs"), address(0xBF80FC50)));
#define RPF5R RPF5R
extern volatile uint32_t   RPF5R __attribute__((section("sfrs"), address(0xBF80FC54)));
typedef struct {
  uint32_t RPF5R:4;
} __RPF5Rbits_t;
